---
kind: method
id: M:Autodesk.Revit.DB.FamilyParameterSet.GetEnumerator
source: html/e4e8d9bb-b7b6-19d9-cc25-0b22b06d9136.htm
---
# Autodesk.Revit.DB.FamilyParameterSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.